In [1]:
import numpy as np
import pandas as pd

In [2]:
titanic_survival = pd.read_csv('train.csv')
titanic_survival.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [21]:
age = titanic_survival['Age']
#print(age.loc[0:10])
age_is_null = pd.isnull(age)
#print(age_is_null)
age_null_true=age[age_is_null]
#print(age_null_true)
age_null_count = len(age_null_true)
print(age_null_count)

0

In [6]:
good_ages = titanic_survival['Age'][age_is_null==False]
correct_mean_age = sum(good_ages)/len(good_ages)
print(correct_mean_age)

29.69911764705882

In [7]:
correct_mean_age = titanic_survival['Age'].mean()
print(correct_mean_age)

29.69911764705882

In [10]:
passenger_classes = [1,2,3]
fares_by_class={}
for this_class in passenger_classes:
    pclass_rows = titanic_survival[titanic_survival['Pclass']==this_class]
    pclass_fares = pclass_rows['Fare']
    fare_for_class = pclass_fares.mean()
    fares_by_class[this_class]=fare_for_class
print(fares_by_class)

{1: 84.15468749999992, 2: 20.66218315217391, 3: 13.675550101832997}

In [15]:
passenger_survival = titanic_survival.pivot_table(index='Pclass',values='Survived',aggfunc=np.mean)
print(passenger_survival)

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

In [16]:
passenger_age = titanic_survival.pivot_table(index='Pclass',values='Age')
print(passenger_age)

Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64

In [19]:
per_stas=titanic_survival.pivot_table(index='Embarked',values=['Fare','Survived'],aggfunc=np.sum)
print(per_stas)

                Fare  Survived
Embarked
C         10072.2962        93
Q          1022.2543        30
S         17439.3988       217

In [23]:
drop_na_columns = titanic_survival.dropna(axis=1)
#print(drop_na_columns)
new_titanic_survival = titanic_survival.dropna(axis=0,subset=['Age','Sex'])

In [27]:
new_titanic_survival = titanic_survival.sort_values('Age',ascending=False)
print(new_titanic_survival)
titanic_reindexed=new_titanic_survival.reset_index(drop=True)

     PassengerId  Survived  Pclass  \
630          631         1       1
851          852         0       3
493          494         0       1
96            97         0       1
116          117         0       3
672          673         0       2
745          746         0       1
33            34         0       2
54            55         0       1
280          281         0       3
456          457         0       1
438          439         0       1
545          546         0       1
275          276         1       1
483          484         1       3
570          571         1       2
252          253         0       1
829          830         1       1
555          556         0       1
625          626         0       1
326          327         0       3
170          171         0       1
684          685         0       2
694          695         0       1
587          588         1       1
366          367         1       1
94            95         0       3
232          233         0       2
268          269         1       1
11            12         1       1
..           ...       ...     ...
718          719         0       3
727          728         1       3
732          733         0       2
738          739         0       3
739          740         0       3
740          741         1       1
760          761         0       3
766          767         0       1
768          769         0       3
773          774         0       3
776          777         0       3
778          779         0       3
783          784         0       3
790          791         0       3
792          793         0       3
793          794         0       1
815          816         0       1
825          826         0       3
826          827         0       3
828          829         1       3
832          833         0       3
837          838         0       3
839          840         1       1
846          847         0       3
849          850         1       1
859          860         0       3
863          864         0       3
868          869         0       3
878          879         0       3
888          889         0       3

                                                 Name     Sex   Age  SibSp  \
630              Barkworth, Mr. Algernon Henry Wilson    male  80.0      0
851                               Svensson, Mr. Johan    male  74.0      0
493                           Artagaveytia, Mr. Ramon    male  71.0      0
96                          Goldschmidt, Mr. George B    male  71.0      0
116                              Connors, Mr. Patrick    male  70.5      0
672                       Mitchell, Mr. Henry Michael    male  70.0      0
745                      Crosby, Capt. Edward Gifford    male  70.0      1
33                              Wheadon, Mr. Edward H    male  66.0      0
54                     Ostby, Mr. Engelhart Cornelius    male  65.0      0
280                                  Duane, Mr. Frank    male  65.0      0
456                         Millet, Mr. Francis Davis    male  65.0      0
438                                 Fortune, Mr. Mark    male  64.0      1
545                      Nicholson, Mr. Arthur Ernest    male  64.0      0
275                 Andrews, Miss. Kornelia Theodosia  female  63.0      1
483                            Turkula, Mrs. (Hedwig)  female  63.0      0
570                                Harris, Mr. George    male  62.0      0
252                         Stead, Mr. William Thomas    male  62.0      0
829         Stone, Mrs. George Nelson (Martha Evelyn)  female  62.0      0
555                                Wright, Mr. George    male  62.0      0
625                             Sutton, Mr. Frederick    male  61.0      0
326                         Nysveen, Mr. Johan Hansen    male  61.0      0
170                         Van der hoef, Mr. Wyckoff    male  61.0      0
684                 Brown, Mr. Thomas William Solomon    male  60.0      1
694                                   Weir, Col. John    male  60.0      0
587                  Frolicher-Stehli, Mr. Maxmillian    male  60.0      1
366  Warren, Mrs. Frank Manley (Anna Sophia Atkinson)  female  60.0      1
94                                  Coxon, Mr. Daniel    male  59.0      0
232                         Sjostedt, Mr. Ernst Adolf    male  59.0      0
268     Graham, Mrs. William Thompson (Edith Junkins)  female  58.0      0
11                           Bonnell, Miss. Elizabeth  female  58.0      0
..                                                ...     ...   ...    ...
718                               McEvoy, Mr. Michael    male   NaN      0
727                          Mannion, Miss. Margareth  female   NaN      0
732                              Knight, Mr. Robert J    male   NaN      0
738                                Ivanoff, Mr. Kanio    male   NaN      0
739                                Nankoff, Mr. Minko    male   NaN      0
740                       Hawksford, Mr. Walter James    male   NaN      0
760                                Garfirth, Mr. John    male   NaN      0
766                         Brewe, Dr. Arthur Jackson    male   NaN      0
768                               Moran, Mr. Daniel J    male   NaN      1
773                                   Elias, Mr. Dibo    male   NaN      0
776                                  Tobin, Mr. Roger    male   NaN      0
778                           Kilgannon, Mr. Thomas J    male   NaN      0
783                            Johnston, Mr. Andrew G    male   NaN      1
790                          Keane, Mr. Andrew "Andy"    male   NaN      0
792                           Sage, Miss. Stella Anna  female   NaN      8
793                          Hoyt, Mr. William Fisher    male   NaN      0
815                                  Fry, Mr. Richard    male   NaN      0
825                                   Flynn, Mr. John    male   NaN      0
826                                      Lam, Mr. Len    male   NaN      0
828                      McCormack, Mr. Thomas Joseph    male   NaN      0
832                                    Saad, Mr. Amin    male   NaN      0
837                               Sirota, Mr. Maurice    male   NaN      0
839                              Marechal, Mr. Pierre    male   NaN      0
846                          Sage, Mr. Douglas Bullen    male   NaN      8
849      Goldenberg, Mrs. Samuel L (Edwiga Grabowska)  female   NaN      1
859                                  Razi, Mr. Raihed    male   NaN      0
863                 Sage, Miss. Dorothy Edith "Dolly"  female   NaN      8
868                       van Melkebeke, Mr. Philemon    male   NaN      0
878                                Laleff, Mr. Kristo    male   NaN      0
888          Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1

     Parch       Ticket      Fare        Cabin Embarked
630      0        27042   30.0000          A23        S
851      0       347060    7.7750          NaN        S
493      0     PC 17609   49.5042          NaN        C
96       0     PC 17754   34.6542           A5        C
116      0       370369    7.7500          NaN        Q
672      0   C.A. 24580   10.5000          NaN        S
745      1    WE/P 5735   71.0000          B22        S
33       0   C.A. 24579   10.5000          NaN        S
54       1       113509   61.9792          B30        C
280      0       336439    7.7500          NaN        Q
456      0        13509   26.5500          E38        S
438      4        19950  263.0000  C23 C25 C27        S
545      0          693   26.0000          NaN        S
275      0        13502   77.9583           D7        S
483      0         4134    9.5875          NaN        S
570      0  S.W./PP 752   10.5000          NaN        S
252      0       113514   26.5500          C87        S
829      0       113572   80.0000          B28      NaN
555      0       113807   26.5500          NaN        S
625      0        36963   32.3208          D50        S
326      0       345364    6.2375          NaN        S
170      0       111240   33.5000          B19        S
684      1        29750   39.0000          NaN        S
694      0       113800   26.5500          NaN        S
587      1        13567   79.2000          B41        C
366      0       110813   75.2500          D37        C
94       0       364500    7.2500          NaN        S
232      0       237442   13.5000          NaN        S
268      1     PC 17582  153.4625         C125        S
11       0       113783   26.5500         C103        S
..     ...          ...       ...          ...      ...
718      0        36568   15.5000          NaN        Q
727      0        36866    7.7375          NaN        Q
732      0       239855    0.0000          NaN        S
738      0       349201    7.8958          NaN        S
739      0       349218    7.8958          NaN        S
740      0        16988   30.0000          D45        S
760      0       358585   14.5000          NaN        S
766      0       112379   39.6000          NaN        C
768      0       371110   24.1500          NaN        Q
773      0         2674    7.2250          NaN        C
776      0       383121    7.7500          F38        Q
778      0        36865    7.7375          NaN        Q
783      2   W./C. 6607   23.4500          NaN        S
790      0        12460    7.7500          NaN        Q
792      2     CA. 2343   69.5500          NaN        S
793      0     PC 17600   30.6958          NaN        C
815      0       112058    0.0000         B102        S
825      0       368323    6.9500          NaN        Q
826      0         1601   56.4958          NaN        S
828      0       367228    7.7500          NaN        Q
832      0         2671    7.2292          NaN        C
837      0       392092    8.0500          NaN        S
839      0        11774   29.7000          C47        C
846      2     CA. 2343   69.5500          NaN        S
849      0        17453   89.1042          C92        C
859      0         2629    7.2292          NaN        C
863      2     CA. 2343   69.5500          NaN        S
868      0       345777    9.5000          NaN        S
878      0       349217    7.8958          NaN        S
888      2   W./C. 6607   23.4500          NaN        S

[891 rows x 12 columns]

In [28]:
def hundredth_row(column):
    hundredth_item=column.loc[99]
    return hundredth_item

hundredth_row=titanic_survival.apply(hundredth_row)
print(hundredth_row)

PassengerId                  100
Survived                       0
Pclass                         2
Name           Kantor, Mr. Sinai
Sex                         male
Age                           34
SibSp                          1
Parch                          0
Ticket                    244367
Fare                          26
Cabin                        NaN
Embarked                       S
dtype: object

In [29]:
def not_null_count(column):
    column_null = pd.isnull(column)
    null = column[column_null]
    return len(null)

column_null_count = titanic_survival.apply(not_null_count)
print(column_null_count)

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [32]:
def generate_age_label(row):
    age=row['Age']
    if pd.isnull(age):
        return 'unknown'
    elif age<18:
        return 'minor'
    else:
        return 'adult'
    
age_labels = titanic_survival.apply(generate_age_label,axis=1)
print(age_labels)

0        adult
1        adult
2        adult
3        adult
4        adult
5      unknown
6        adult
7        minor
8        adult
9        minor
10       minor
11       adult
12       adult
13       adult
14       minor
15       adult
16       minor
17     unknown
18       adult
19     unknown
20       adult
21       adult
22       minor
23       adult
24       minor
25       adult
26     unknown
27       adult
28     unknown
29     unknown
        ...
861      adult
862      adult
863    unknown
864      adult
865      adult
866      adult
867      adult
868    unknown
869      minor
870      adult
871      adult
872      adult
873      adult
874      adult
875      minor
876      adult
877      adult
878    unknown
879      adult
880      adult
881      adult
882      adult
883      adult
884      adult
885      adult
886      adult
887      adult
888    unknown
889      adult
890      adult
dtype: object